#include <iostream>

/*
ледната задача да се реши на един от езиците за програмиране C++ или Java.
Дадена е floatматрица imgс размери М ≤ 10реда и N ≤ 10стълба. Напишете функция
subsample, която получава като аргументи M, Nи imgи извежда на екрана матрица sс размери
(М+1)/2и (N+1)/2 (при целочислено деление), всеки елемент s[i][j]на която е равен на
средно аритметичното от всички елементи img[y][x], такива че
i*2 ≤ y ≤ i*2+1и j*2 ≤ x ≤ j*2+1.
Например, при матрица img, представена таблично по следния начин:
1.0 2.0 3.0
4.5 6.5 7.5
функцията да извежда на екрана:
3.5 5.25

 */


void subsample(int M, int N, const float img[][10]) {
    float s[5][5] = {0, };
    for(int i = 0; i < (M + 1) / 2; ++i) {
        for(int j = 0; j < (N + 1) / 2; ++j) {
            int cnt = 0;
                for(int y = 0; y < M; ++y) {
                    for(int x = 0; x < N; ++x) {
                        if(i * 2 <= y && y <= i * 2 + 1 && j * 2 <= x & x <= j * 2 + 1) {
                            s[i][j] += img[y][x];
                            ++cnt;
                        }
                    }
                }
                s[i][j] /= cnt ? cnt : 1;
                std::cout << s[i][j] << " ";
        }
        std::cout << '\n';
    }
}

int main() {
    const float img[2][10] = {
        {1.0, 2.0, 3.0},
        {4.5, 6.5, 7.5}
    };
    subsample(2, 3, img);

    return 0;
}